//
//  backjoon_15890.swift
//  algo
//
//  Created by 이재은 on 2020/10/07.
//  Copyright © 2020 이재은. All rights reserved.
//

import Foundation

//backjoon 15890 전국 대학생 프로그래밍 대회 동아리 연합 여름 대회 2018
//
//문제
//UCPC는 전국 대학생 프로그래밍 대회 동아리 연합(이하 전대프연)에서 진행하는 여름 대회입니다. 2011년 제1회 UCPC를 시작으로 2016년 제6회 UCPC를 성공적으로 개최하였으며, 올해 제7회 UCPC를 준비하고 있습니다. 매년 여름에 진행하는 UCPC는 ACM-ICPC를 준비하는 팀들에게 훌륭한 연습기회가 되고 있고, 프로그래밍 대회라는 하나의 공통적인 목표와 학구열을 가진 학생들에게 좋은 교류와 경쟁의 장이 되고 있습니다.
//
//입력
//본 문제는 입력이 없다.
//
//출력
//UCPC 2018의 본선이 열리는 날짜를 YYYYMMDD 형식으로 출력한다. YYYY는 년을 4자리로 나타낸 수를 뜻하고, MM은 월을 2자리로 나타낸 수, DD는 일을 2자리로 나타낸 수를 뜻한다. 만약 MM, DD 자리에 올 수가 2자리보다 짧다면 앞에 0을 붙여 2자리로 만들어 출력한다. 출력 예제에 나와있는 수는 어떤 형식으로 출력해야하는지 알려주기 위해 임의의 날짜를 출력한 것임을 주의하라.

print(20180729)
